//Node js module

//মডিউল কি?
//মডিউল হচ্ছে সেট অফ ফাংশন
//মডিউলের মধ্যে অনেক গুলো ফাংশন  তৈরি  করা আছে
//লোকাল মডিউল //যে মডিউল গুলো আমরা তৈরি করব।
//মডিউল তিন ধরনের, লোকাল মডিউল, বিল্ড ইন মডিউল,েএকট্রালনাল মডিউল

// এক্সট্রালনাল মডিউল ব্যবহার করতে হলে npm ব্যবহার করা লাগে । 



//node js শেখার আগে আমরা কমান্ড শিখে আসব

//প্রথমে আমরা যে ফোল্ডার এ আছি তার মধ্যে কতগুলো ফোল্ডার আছে তা দেখতে dir command ব্যাবহার করব

//command clear করতে cls ব্যবহার করতে হয় 


// এক ডিরেকটোরি থেকে অন্য ডিরেকটোরিতে যেতে cd এর পর যে ডিরেকটোরিতে যাবেন তার নাম দিতে হয়

//আমরা যদি আগের ডিরেকটোরিতে যেতে চাই তাহলে cd.. ব্যাবহার কর হয় ।


//  আমরা যদি নতুন ডিরেক্টরি তৈরি করতে চাই তাহেল mkdir লিখে নতুন ডিরেক্টরির নাম দিবো

// আমরা যদি ডিরেক্টরি ডিলিট করতে চাই তাহলে প্রথমে rmdir লিখে যে ডিরেক্টরি ডিলেট করতে চাই তার নাম দিবো

// আমরা কোন ডিরেক্টরি তে আছি সেটা দেখতে pwd ব্যবহার করা হয় 


//ডিরেক্টরিতে ফাইল তৈরি করতে echo > এই কমান্ড তারপর ফাইল এর নাম extention  সহ দিতে হবে


//ফাইল ডিলিট করতে  del তারপর ফাইল  এর নাম extention সহ ব্যাবহার করতে হবে
